In [1]:
import pandas as pd
import numpy as np

In [13]:
data = np.random.randint(0,100, size=(4,3))

In [14]:
data

array([[53, 82, 20],
       [82, 47, 12],
       [27, 50, 26],
       [27, 12, 89]])

In [15]:
df = pd.DataFrame(data)
df

    0   1   2
0  53  82  20
1  82  47  12
2  27  50  26
3  27  12  89

In [16]:
type(df)

pandas.core.frame.DataFrame

In [17]:
type(df[0])

pandas.core.series.Series

In [18]:
type(df[0][0])

numpy.int64

In [19]:
new_df = pd.DataFrame(data, index = ["Özay", "Melih", "Merve", "İlkim"], columns = ["Salary", "Age", "Seniority"])

In [20]:
new_df

       Salary  Age  Seniority
Özay       53   82         20
Melih      82   47         12
Merve      27   50         26
İlkim      27   12         89

In [21]:
new_df["Age"]

Özay     82
Melih    47
Merve    50
İlkim    12
Name: Age, dtype: int64

In [22]:
new_df[["Age", "Salary"]]

       Age  Salary
Özay    82      53
Melih   47      82
Merve   50      27
İlkim   12      27

In [24]:
new_df.loc["Özay"]

Salary       53
Age          82
Seniority    20
Name: Özay, dtype: int64

In [25]:
new_df.iloc[0]

Salary       53
Age          82
Seniority    20
Name: Özay, dtype: int64

In [27]:
new_df.iloc[:,1]

Özay     82
Melih    47
Merve    50
İlkim    12
Name: Age, dtype: int64

In [29]:
new_df.iloc[0, 0]  # Özay Salary

np.int64(53)

In [30]:
new_df.iloc[:, 0]   # Tüm Salary sütunu

Özay     53
Melih    82
Merve    27
İlkim    27
Name: Salary, dtype: int64

In [31]:
new_df.iloc[[0, 2]]     # Özay ve Merve

       Salary  Age  Seniority
Özay       53   82         20
Merve      27   50         26

In [32]:
new_df.iloc[0:2, 0:2]   # Özay & Melih → Salary ve Age

       Salary  Age
Özay       53   82
Melih      82   47